In [2]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import scipy.stats

In [12]:
!wget -nc https://lazyprogrammer.me/course_files/sp500_close.csv
!wget -nc https://lazyprogrammer.me/course_files/SPY.csv

File ‘sp500_close.csv’ already there; not retrieving.

--2025-06-24 12:00:35--  https://lazyprogrammer.me/course_files/SPY.csv
Resolving lazyprogrammer.me (lazyprogrammer.me)... 2606:4700:130:436c:6f75:6466:6c61:7265, 172.64.80.1
Connecting to lazyprogrammer.me (lazyprogrammer.me)|2606:4700:130:436c:6f75:6466:6c61:7265|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 251935 (246K) [text/csv]
Saving to: ‘SPY.csv’

SPY.csv             100%[===================>] 246.03K  --.-KB/s    in 0.1s

2025-06-24 12:00:36 (1.93 MB/s) - ‘SPY.csv’ saved [251935/251935]

In [70]:
close = pd.read_csv('sp500_close.csv')
spy = pd.read_csv('SPY.csv')

In [71]:
close.head()

,Unnamed: 0,AAL,AAPL,AAP,ABBV,ABC,ABT,ACN,ADBE,ADI,...,XLNX,XL,XOM,XRAY,XRX,XYL,YUM,ZBH,ZION,ZTS
0,2013-02-08,14.75,67.8542,78.90,36.25,46.89,34.41,73.31,39.12,45.70,...,37.51,28.24,88.61,42.87,31.84,27.09,65.30,75.85,24.14,33.05
1,2013-02-09,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,2013-02-10,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,2013-02-11,14.46,68.5614,78.39,35.85,46.76,34.26,73.07,38.64,46.08,...,37.46,28.31,88.28,42.84,31.96,27.46,64.55,75.65,24.21,33.26
4,2013-02-12,14.27,66.8428,78.60,35.42,46.96,34.30,73.37,38.89,46.27,...,37.58,28.41,88.46,42.87,31.84,27.95,64.75,75.44,24.49,33.74

In [16]:
spy.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2010-01-04,112.370003,113.389999,111.510002,113.330002,92.246048,118944600
1,2010-01-05,113.260002,113.680000,112.849998,113.629997,92.490204,111579900
2,2010-01-06,113.519997,113.989998,113.430000,113.709999,92.555328,116074400
3,2010-01-07,113.500000,114.330002,113.180000,114.190002,92.946060,131091100
4,2010-01-08,113.889999,114.620003,113.660004,114.570000,93.255348,126402800

In [72]:
spy.dropna(inplace=True)
spy['returns'] = spy['Close'].pct_change(1)

In [73]:
spy['returns'].mean()

0.00039037590123461676

In [66]:
close.head()

,Unnamed: 0,AAL,AAPL,AAP,ABBV,ABC,ABT,ACN,ADBE,ADI,...,XLNX,XL,XOM,XRAY,XRX,XYL,YUM,ZBH,ZION,ZTS
0,2013-02-08,14.75,67.8542,78.90,36.25,46.89,34.41,73.31,39.12,45.70,...,37.51,28.24,88.61,42.87,31.84,27.09,65.30,75.85,24.14,33.05
1,2013-02-09,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,2013-02-10,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,2013-02-11,14.46,68.5614,78.39,35.85,46.76,34.26,73.07,38.64,46.08,...,37.46,28.31,88.28,42.84,31.96,27.46,64.55,75.65,24.21,33.26
4,2013-02-12,14.27,66.8428,78.60,35.42,46.96,34.30,73.37,38.89,46.27,...,37.58,28.41,88.46,42.87,31.84,27.95,64.75,75.44,24.49,33.74

In [74]:
close.head()
close.dropna(how='all', inplace=True)

In [75]:
# rename Date Column
close.rename(columns={close.columns[0]: 'Date'}, inplace=True)
close['Date'] = pd.to_datetime(close['Date'], format='%Y-%m-%d')
# Set 'Date' as index if not already
close.set_index('Date', inplace=True)

# Calculate returns for all tickers
returns = close.pct_change(1)

# Reset index if you want 'Date' as a column
returns = returns.reset_index()

# Now 'returns' has the same columns (tickers), each with their return series
returns.head()

/var/folders/1j/p8whwxms6f1814w2ryl5tf580000gn/T/ipykernel_55973/491647183.py:8: FutureWarning: The default fill_method='pad' in DataFrame.pct_change is deprecated and will be removed in a future version. Either fill in any non-leading NA values prior to calling pct_change or specify 'fill_method=None' to not fill NA values.
  returns = close.pct_change(1)

,Date,AAL,AAPL,AAP,ABBV,ABC,ABT,ACN,ADBE,ADI,...,XLNX,XL,XOM,XRAY,XRX,XYL,YUM,ZBH,ZION,ZTS
0,2013-02-08,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2013-02-09,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.00000,0.000000,...,0.000000,0.000000,0.000000,0.0000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
2,2013-02-10,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.00000,0.000000,...,0.000000,0.000000,0.000000,0.0000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
3,2013-02-11,-0.019661,0.010422,-0.006464,-0.011034,-0.002772,-0.004359,-0.003274,-0.01227,0.008315,...,-0.001333,0.002479,-0.003724,-0.0007,0.003769,0.013658,-0.011485,-0.002637,0.002900,0.006354
4,2013-02-12,-0.013140,-0.025067,0.002679,-0.011994,0.004277,0.001168,0.004106,0.00647,0.004123,...,0.003203,0.003532,0.002039,0.0007,-0.003755,0.017844,0.003098,-0.002776,0.011565,0.014432

In [76]:
# Drop the first row with NaN values
returns.drop(0, inplace=True, axis = 0)
returns.head()

,Date,AAL,AAPL,AAP,ABBV,ABC,ABT,ACN,ADBE,ADI,...,XLNX,XL,XOM,XRAY,XRX,XYL,YUM,ZBH,ZION,ZTS
1,2013-02-09,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
2,2013-02-10,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
3,2013-02-11,-0.019661,0.010422,-0.006464,-0.011034,-0.002772,-0.004359,-0.003274,-0.012270,0.008315,...,-0.001333,0.002479,-0.003724,-0.000700,0.003769,0.013658,-0.011485,-0.002637,0.002900,0.006354
4,2013-02-12,-0.013140,-0.025067,0.002679,-0.011994,0.004277,0.001168,0.004106,0.006470,0.004123,...,0.003203,0.003532,0.002039,0.000700,-0.003755,0.017844,0.003098,-0.002776,0.011565,0.014432
5,2013-02-13,0.027330,-0.001903,0.004707,-0.004235,-0.006814,0.004665,0.002590,-0.002057,-0.000216,...,0.005854,0.000352,0.002374,0.004899,0.005025,0.011091,-0.005251,0.007423,0.010208,-0.005631

In [79]:
mean = returns.iloc[:,1:].mean()
mean

AAL     0.000858
AAPL    0.000542
AAP     0.000306
ABBV    0.000724
ABC     0.000450
          ...
XYL     0.000599
YUM     0.000213
ZBH     0.000314
ZION    0.000534
ZTS     0.000510
Length: 505, dtype: float64

In [81]:
std = returns.iloc[:,1:].std()
std

AAL     0.018651
AAPL    0.012120
AAP     0.015739
ABBV    0.014002
ABC     0.011572
          ...
XYL     0.011371
YUM     0.013706
ZBH     0.010875
ZION    0.013584
ZTS     0.011745
Length: 505, dtype: float64

In [82]:
highest_means = mean.sort_values(ascending=False).head(10)
highest_means

NVDA    0.001766
NFLX    0.001528
AMD     0.001297
ALGN    0.001224
EA      0.001209
MU      0.001185
AVGO    0.001183
DXC     0.001170
INCY    0.001149
FB      0.001145
dtype: float64

In [83]:
highest_stds = std.sort_values(ascending=False).head(10)
highest_stds

CHK     0.034583
AMD     0.031379
BHGE    0.029268
FCX     0.028327
LNT     0.027707
VRTX    0.026658
INCY    0.024731
MRO     0.024688
WMB     0.024539
UA      0.023768
dtype: float64

           0
0.018651 NaN
0.012120 NaN
0.015739 NaN
0.014002 NaN
0.011572 NaN
...       ..
0.011371 NaN
0.013706 NaN
0.010875 NaN
0.013584 NaN
0.011745 NaN

[505 rows x 1 columns]